

import UIKit

class InfoForMe: NSObject {

}
/*
    после того как был создан новый клас CustomTableViewCell, то мы приводим к типу нашу ячейку к его уже новому типу
    создаем модель для хранения данных Swift file.
    создаем функцию, которая заполняет массив данных с обектов структуры
    segue show создает кнопку вовзрата если используется Navigation Control
    segue show detail можно использовать совместно с UISplitViewController (экран настроек в ipad)
    segue presetn modaly позволяет появляться viewController с разных сторон (снизу сверху). Перекрыввет текущий VC
    segue predent As popover позволяет отобразить VC в виде всплывающего окна
    segue custom позаоляет настроить параметры перехода самостоятельно
 ячейки в VC New Place делаем статичными вместо динамичных. Для этого выделяем сам TVC и меняем параметр Content на Static cell
 в этом случае идентификатор не требуется
 Capitalisation - sentenses - задает написание предлоежения с большой буквы
 чтобы отменить выделение ячейки, выбираем ее и параметр selection меняем на done
 
 
 
 
 
 */
